= Strongly Connected Components

_SCC_ is a class algorithms for finding groups of nodes where each node is directly reachable from every other node in the group. 
The strongly connected components  of an arbitrary directed graph form a partition into subgraphs that are themselves strongly connected.There are several algorithms to compute the SCC.

== History, Explanation

Decomposing a directed graph into its strongly connected components is a classic application of depth-first search. 
The problem of finding connected components is at the heart of many graph application. 
Generally speaking, the connected components of the graph correspond to different classes of objects. 
The first linear-time algorithm for strongly connected components is due to Tarjan (1972).

== When to use it / use-cases

== Constraints / when not to use it

== Algorithm explanation on simple sample graph

image::{img}/strongly_connected_components.png[]

A directed graph is strongly connected if there is a path between all pairs of vertices. 
This algorithms treats the graph as directed, so the direction of the relationship is important and strongly connected compoment exists only if there are relationships between nodes in both direction. 

.Create sample graph
[source,cypher]
----
CREATE (nAlice:User {id:'Alice'})
,(nBridget:User {id:'Bridget'})
,(nCharles:User {id:'Charles'})
,(nDoug:User {id:'Doug'})
,(nMark:User {id:'Mark'})
,(nMichael:User {id:'Michael'})
CREATE (nAlice)-[:FOLLOW]->(nBridget)
,(nAlice)-[:FOLLOW]->(nCharles)
,(nMark)-[:FOLLOW]->(nDoug)
,(nMark)-[:FOLLOW]->(nMichael)
,(nBridget)-[:FOLLOW]->(nMichael)
,(nDoug)-[:FOLLOW]->(nMark)
,(nMichael)-[:FOLLOW]->(nAlice)
,(nAlice)-[:FOLLOW]->(nMichael)
,(nBridget)-[:FOLLOW]->(nAlice)
,(nMichael)-[:FOLLOW]->(nBridget)
----

.Running algorithm and writing back results
[source,cypher]
----
CALL algo.scc('User','FOLLOW', {write:true,partitionProperty:'partition'})
YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize
----

.Results
[opts="header",cols="1,1"]
|===
| name | partition
| Alice | 1
| Bridget | 1
| Michael | 1
| Charles | 0
| Doug | 2
| Mark | 2 
|===

We can see that we have 2 strongly connected components in our sample graph. The first and biggest component has members Alice,Bridget,Michael and the second compomenet has Doug and Mark. 

.Find the largest partition
[source,cypher]
----
MATCH (u:User)
RETURN distinct(u.partition) as partition,count(*) as size_of_partition ORDER by size_of_partition DESC LIMIT 1
----
== Example Usage

== Syntax

.Running algorithm and writing back results
[source,cypher]
----
CALL algo.scc(label:String, relationship:String, {write:true,partitionProperty:'partition'}) 
YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize

- finds strongly connected partitions and potentially writes back to the node as a property partition. 
----

.Parameters
[opts="header",cols="1,1,1,1,4"]
|===
| name | type | default | optional | description
| label  | string | null | yes | label to load from the graph, if null load all nodes
| relationship | string | null | yes | relationship-type to load from the graph, if null load all nodes
| write | boolean | true | yes | if result should be written back as node property
| partitionProperty | string | 'partition' | yes | property name written back to

|===

.Results
[opts="header",cols="1,1,6"]
|===
| name | type | description
| setCount | int | number of partitions found
| maxSetSize | int | number of members in biggest partition
| minSetSize | int | number of members in smallest partition
| loadMillis | int | milliseconds for loading data
| computeMillis | int | milliseconds for running the algorithm
| writeMillis | int | milliseconds for writing result data back
|===

== References

== Implementation Details

:leveloffset: +1
// copied from: https://github.com/neo4j-contrib/neo4j-graph-algorithms/issues/97

_SCC_ is a class algorithms for finding groups of nodes where each node is directly reachable from every other node in the group. There are several algorithms to compute the SCC. Our current implementation (still in graphtest project) implements _Tarjan's_ SCC algorithm.

## Progress

- [ ] copy implementation from graphtest-project
- [ ] implement procedure
- [ ] tests
- [ ] edge case tests
- [ ] simple benchmark 
- [ ] benchmark on bigger graphs
- [ ] parallelization
- [ ] evaluation
- [ ] documentation
